harviswang/linux-3.10.99/arch/mips/m200/inc/hw_ddrc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_WCMDCTRL1 register.
//
//*****************************************************************************
#define DDRC_WCMDCTRL1_WLT      0xF8000000  // wcmd_lock_thd, Indicates how many
                                            // wcmd(write commands) are grouped together
                                            // Higher value improves total bandwidth of ddr, but leads to longer read command latency
#define DDRC_WCMDCTRL1_WHM      0x07F80000  // wpage_hit_max, Wpage-hit affects the reorder of wcmd, the wcmd with same page should be grouped
                                            // for higher performance. This register indicates the maximum number of wcmd to be bonded
                                            // Higher value improves total bandwidth of ddr, but leads to longer read maximum latency
#define DDRC_WCMDCTRL1_PQC      0x0007FF80  // pend_qos_cnt, Once the wcmd is accepted, a counter indicates how long the command is pending,
                                            // when the pending time is exceed Pend_QoS once, the priority of this command will increase 1, up to 3,
                                            // which increases the priority to be processed. This mechanism avoids the wcmd with lower priority penging too long
                                            // Dynamic configuration is not recommended
#define DDRC_WCMDCTRL1_WIU      0x0000007C  // warm_in_use, 0~12. Ram to be used in write command reorder
                                            // Configuration is not recommended
#define DDRC_WCMDCTRL1_DR       0x00000002  // disable_reorder, 0: wcmd will be reordered based on priority and pag-hit-conflict
                                            // 1: wcmd will not be reordered, the commands will be process with the order of being received
                                            // Dynamic configuration is not recommended
#define DDRC_WCMDCTRL1_MEW      0x00000001  // msk_empty_wfifo, 0: wcmd is involved in arbitration immediately
                                            // 1: wcmd is not involved in arbitration until receives enough wdata

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_RCMDCTRL0 register.
// rfifo_thd: read fifo threshold
// Read command is not involved in arbitration until the vacancy in rfifo is 
// higher than rfifo threshold. This should improves the DDR performance when
// processing accessing discrete pages. However for page-access(commands access
// the same page continuously) the performance will be lagged as the threshold
// affects the command grouping.
//
//*****************************************************************************
#define DDRC_RCMDCTRL0_C3RIC    0x80000000  // ch3_rcmd_igr_cflit, 0: disable
                                            // 1: enable. Consistence between wcmd and rcmd will not be guaranteed
#define DDRC_RCMDCTRL0_C3RFTE   0x40000000  // ch3_rfifo_thd_en, 0: disable rfifo_thd(recommended)
                                            // 1: enable rfifo_thd
#define DDRC_RCMDCTRL0_C3RFT    0x3F000000  // If Ch3 rfifo level threshold higher than this value, rcmd request is masked
#define DDRC_RCMDCTRL0_C2RIC    0x00800000  // ch2_rcmd_igr_cflit
#define DDRC_RCMDCTRL0_C2RFTE   0x00400000  // ch2_rfifo_thd_en
#define DDRC_RCMDCTRL0_C2RFT    0x003F0000  // ch2_rfifo_thd
#define DDRC_RCMDCTRL0_C0RIC    0x00000080  // ch0_rcmd_igr_cflit
#define DDRC_RCMDCTRL0_C0RFTE   0x00000040  // ch0_rfifo_thd_en
#define DDRC_RCMDCTRL0_C0RFT    0x0000003F  // ch0_rfifo_thd

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_RCMDCTRL1 register.
//
//*****************************************************************************
#define DDRC_RCMDCTRL1_C6RIC    0x00800000  // ch6_rcmd_igr_cflit
#define DDRC_RCMDCTRL1_C6RFTE   0x00400000  // ch6_rfifo_thd_en
#define DDRC_RCMDCTRL1_C6RFT    0x003F0000  // ch6_rfifo_thd
#define DDRC_RCMDCTRL1_C5RIC    0x00008000  // ch5_rcmd_igr_cflit
#define DDRC_RCMDCTRL1_C5RFTE   0x00004000  // ch5_rfifo_thd_en
#define DDRC_RCMDCTRL1_C5RFT    0x00003F00  // ch5_rfifo_thd
#define DDRC_RCMDCTRL1_C4RIC    0x00000080  // ch4_rcmd_igr_cflit
#define DDRC_RCMDCTRL1_C4RFTE   0x00000040  // ch4_rfifo_thd_en
#define DDRC_RCMDCTRL1_C4RFT    0x0000003F  // ch4_rfifo_thd

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_WDATTHD0 register.
// wfifo_thd: wdata fifo thresthold
// The threshold guarantees the wcmd will not be involved in arbitration until
// receive enough wdata. This improves DDR performance for AXI write access which
// wdata does not continuously transfer on bus. But for continuous transfer,
// performance would be worse.
//
//*****************************************************************************
#define DDRC_WDATTHD0_C3WFTE    0x40000000  // ch3_wfifo_thd_en, 1: Enabled
                                            // 0: Disabled(recommended)
#define DDRC_WDATTHD0_C3WFT     0x3F000000  // wcmd is involved in arbitration
                                            // before receiving all wdata
#define DDRC_WDATTHD0_C2WFTE    0x00400000  // ch2_wfifo_thd_en
#define DDRC_WDATTHD0_C2WFT     0x003F0000  // ch2_wfifo_thd
#define DDRC_WDATTHD0_C0WFTE    0x00000040  // ch0_wfifo_thd_en
#define DDRC_WDATTHD0_C0WFT     0x0000003F  // ch0_wfifo_thd

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_WDATTHD1 register.
//
//*****************************************************************************
#define DDRC_WDATTHD1_C6WFTE    0x00400000  // ch6_wfifo_thd_en
#define DDRC_WDATTHD1_C6WFT     0x003F0000  // ch6_wfifo_thd
#define DDRC_WDATTHD1_C5WFTE    0x00004000  // ch5_wfifo_thd_en
#define DDRC_WDATTHD1_C5WFT     0x00003F00  // ch5_wfifo_thd
#define DDRC_WDATTHD1_C4WFTE    0x00000040  // ch4_wfifo_thd_en
#define DDRC_WDATTHD1_C4WFT     0x0000003F  // ch4_wfifo_thd

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_IPORTWPRI register.
// Priority affects on arbitration between ports. Transfers with higher priority
// will be grant first.
// port_pri: priority provided by masters.
// iport_pri: register configurable which applies to each port.
// iport_wpri is write channel priority. iport_rpri is read channel priority
// The finial priority is the larger value of port_pri and iport_pri.
//
//*****************************************************************************
#define DDRC_IPORTWPRI_C6IWPE   0x08000000  // ch6_iport_wpri_en, Enable iport_wpri
                                            // 0: disable, use external priority
                                            // 1: enable, use max priority of external and internal priority
#define DDRC_IPORTWPRI_C6IWP    0x03000000  // ch6_iport_wpri, Priority of write channel 6
                                            // 0x3: the highest priority
                                            // ...
                                            // 0x0: the lowest priority
#define DDRC_IPORTWPRI_C5IWPE   0x00800000  // ch5_iport_wpri_en
#define DDRC_IPORTWPRI_C5IWP    0x00300000  // ch5_iport_wpri
#define DDRC_IPORTWPRI_C4IWPE   0x00080000  // ch4_iport_wpri_en
#define DDRC_IPORTWPRI_C4IWP    0x00030000  // ch4_iport_wpri
#define DDRC_IPORTWPRI_C3IWPE   0x00008000  // ch3_iport_wpri_en
#define DDRC_IPORTWPRI_C3IWP    0x00003000  // ch3_iport_wpri
#define DDRC_IPORTWPRI_C2IWPE   0x00000800  // ch2_iport_wpri_en
#define DDRC_IPORTWPRI_C2IWP    0x00000300  // ch2_iport_wpri
#define DDRC_IPORTWPRI_C1IWPE   0x00000008  // ch1_iport_wpri_en
#define DDRC_IPORTWPRI_C1IWP    0x00000003  // ch1_iport_wpri

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_IPORTRPRI register.
//
//*****************************************************************************
#define DDRC_IPORTRPRI_C6IRPE   0x08000000  //  ch6_iport_rpri_en. Enable iport_rpri
#define DDRC_IPORTRPRI_C6IRP    0x03000000  //  ch6_iport_rpri. Priority of read channel 6
#define DDRC_IPORTRPRI_C5IRPE   0x00800000  //  ch5_iport_rpri_en
#define DDRC_IPORTRPRI_C5IRP    0x00300000  //  ch5_iport_rpri
#define DDRC_IPORTRPRI_C4IRPE   0x00080000  //  ch4_iport_rpri_en
#define DDRC_IPORTRPRI_C4IRP    0x00030000  //  ch4_iport_rpri
#define DDRC_IPORTRPRI_C3IRPE   0x00008000  //  ch3_iport_rpri_en
#define DDRC_IPORTRPRI_C3_IRP   0x00003000  //  ch3_iport_rpri
#define DDRC_IPORTRPRI_C2IRPE   0x00000800  //  ch2_iport_rpri_en
#define DDRC_IPORTRPRI_C2IRP    0x00000300  //  ch2_iport_rpri
#define DDRC_IPORTRPRI_C1IRPE   0x00000008  //  ch1_iport_rpri_en
#define DDRC_IPORTRPRI_C1IRP    0x00000003  //  ch1_iport_rpri

//*****************************************************************************
//
// The following are defines for the bit fields in the DDRC_O_CHxWDOS0 register.
// QoS: the QoS controller is a timer, it indicates that how long the command is
// pending. Once the timer exceed predefined threshold(con), the priority increases
// by 1, up to top-limit(max). The higher priority is, the sooner it will be processed.
//
//*****************************************************************************
#define DDRC_CHxWDOS0_

#endif /* __DDRC_H__ */
